postman/3d023de1-bacf-484f-9c27-a2f914a39761/collection/bece27bb-0048-4ac2-9db0-03107976f33e.json

{"info":{"_postman_id":"bece27bb-0048-4ac2-9db0-03107976f33e","name":"SOAP","schema":"https://schema.getpostman.com/json/collection/v2.1.0/collection.json"},"item":[{"name":"Capital","id":"bd9ec30c-1d08-4fb0-8959-32456e52bbaa","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"method":"POST","header":[{"key":"Content-Type","value":"text/xml","type":"text"}],"body":{"mode":"raw","raw":"<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <CapitalCity xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n            <sCountryISOCode>BY</sCountryISOCode>\r\n        </CapitalCity>\r\n    </Body>\r\n</Envelope>","options":{"raw":{"language":"xml"}}},"url":{"raw":"http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL","protocol":"http","host":["webservices","oorsprong","org"],"path":["websamples.countryinfo","CountryInfoService.wso"],"query":[{"key":"WSDL","value":null}]}},"response":[]},{"name":"Flag","id":"5553d6b6-55e0-48bc-94ad-d66712351948","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"method":"POST","header":[{"key":"Content-Type","value":"text/xml","type":"text"}],"body":{"mode":"raw","raw":"<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <CountryFlag xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n            <sCountryISOCode>USA</sCountryISOCode>\r\n        </CountryFlag>\r\n    </Body>\r\n</Envelope>","options":{"raw":{"language":"xml"}}},"url":{"raw":"http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL","protocol":"http","host":["webservices","oorsprong","org"],"path":["websamples.countryinfo","CountryInfoService.wso"],"query":[{"key":"WSDL","value":null}]}},"response":[]},{"name":"Language","id":"c43d07c7-e43a-408e-8329-f7d938909d10","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"method":"POST","header":[{"key":"Content-Type","value":"text/xml","type":"text"}],"body":{"mode":"raw","raw":"<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <LanguageName xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n            <sISOCode>en</sISOCode>\r\n        </LanguageName>\r\n    </Body>\r\n</Envelope>","options":{"raw":{"language":"xml"}}},"url":{"raw":"http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL","protocol":"http","host":["webservices","oorsprong","org"],"path":["websamples.countryinfo","CountryInfoService.wso"],"query":[{"key":"WSDL","value":null}]}},"response":[]}]}